<svelte:head>
	<title>About</title>
	<meta name="description" content="About this app" />
</svelte:head>

<div class="text-column">
	<h1>О технологическом цикле</h1>

	<p>Почему Svelte, Vite наилучшим образом  подходят для построения «крупномасштабных приложений»?<br>
	<b>Svelte</b> представляет собой современную JavaScript-среду предназначенную для создания пользовательских интерфейсов. 
		По сравнению с другими фреймворками он обеспечивает ряд преимуществ, например:
		<ul>
			<li>Минимальное шаблонирование и накладные расходы разрабоки</li>
			<li>Ускорение загрузки за счет отделения кода от отложенной загрузки.</li>
			<li>Повышение производительности выполнения за счет оптимизации виртуального DOM.</li>
		</ul>
		<p><b>Vite</b> является современным инструментарием для сборки проектов JavaScript, 
			цель которого — обеспечить быструю и эффективную сборку. Он обеспечивает ряд преимуществ, в том числе:
<ul>
<li>Более быстрое время сборки и опыт разработки по сравнению с традиционными упаковщиками.</li>
<li>загружается только основной код</li>
<li>Улучшенный размер сборки, так как Vite включает только необходимый код.</li>
<li>Легкий и оптимизированный для современной веб-разработки.</li>
</ul>
<p>Говоря о «крупномасштабных приложениях», мы имеем в виду приложения с большой кодовой базой, 
	большим числом пользователей и широким набором функций. 
	Таким приложениям как правило необходим эффективный и масштабируемый код, 
	способный поддерживать высокий трафик и большие объемы данных.
<p>В проектах такого рода возникает несколько общих проблем, таких как:
<ul>
<li>Обслуживание кода и масштабируемость
<li>Качество кода и производительность
<li>Организация и структура кода
</ul>
<p>Чтобы решить эти проблемы, здесь мы будем использовать лучшие методы организации и структуры кода, 
	таких как использование централизованного диспетчера состояний и реализацию  строгого контроля типа 
	посредством TypeScript. Кроме того, для наших моделей и компонентов будут применяться модульные тесты, 
	что поможет повысить качество кода и выявление ошибок на ранних этапах процесса разработки.
<p>Конечная цель состоит в создании основы, которая сможет удовлетворить требования 
	предъявляемые к нашему приложению способную легко расширяться и обеспечивать поддержку по мере роста базового кода.

</div>
